CREATE_TEACHERS_TABLE = """
CREATE TABLE IF NOT EXISTS teachers (
    id SERIAL PRIMARY KEY,
    name VARCHAR(255) NOT NULL UNIQUE
);
"""

CREATE_BODY_CLASSROOM_TABLE = """
CREATE TABLE IF NOT EXISTS body_classroom (
    id SERIAL PRIMARY KEY,
    name VARCHAR(255) NOT NULL UNIQUE
);
"""

CREATE_LINKING_TABLE = """
CREATE TABLE IF NOT EXISTS linking (
    id SERIAL PRIMARY KEY,
    subject VARCHAR(255) NOT NULL,
    type_subj VARCHAR(255) NOT NULL,
    teacher VARCHAR(255) NOT NULL,
    group_name VARCHAR(255) NOT NULL,
    id_para int4 not null
);
"""

SELECT_LINKING_MAX_ID_PARA = """
SELECT max(id_para) from linking;
"""

INSERT_LINKING = """
INSERT INTO linking (subject, type_subj, teacher, group_name, id_para)
values
	
"""

CHECK_LINKING = """
select * from linking
where subject=
"""

SELECT_LINKING = """
select subject, type_subj, teacher, group_name, id_para from linking;
"""

DELETE_LINKING_STROKE = """
DELETE FROM linking
where subject=
"""

CREATE_HOURS_TABLE = """
create table if not exists hours (
	id serial primary key,
	subject_name text not null,
	group_name text not null,
	seminars int4 not null,
	lectures int4 not null,
	labs int4 not null
)
"""

CREATE_LOCK_SLOT_TABLE = """
create table if not exists lock_slot (
    id serial primary key,
    group_name text not null,
    day text not null,
    time text not null,
    numerator BOOLEAN not null,
    denominator BOOLEAN not null,
    body text not null
)
"""

INSERT_BODY_CLASSROOM_TABLE = """
INSERT INTO body_classroom (name)
values
    ('В7'),
    ('В4к'),
    ('ГЗ'),
    ('УЛК'),
    ('Хим. Лаб.'),
    ('Т')
"""

SELECT_BODY_CLASSROOM = """
select name from body_classroom ;
"""

CREATE_GROUPS_TABLE = """
CREATE TABLE IF NOT EXISTS groups (
    id SERIAL PRIMARY KEY,
    name VARCHAR(255) NOT NULL UNIQUE,
    count int4 NOT NULL
);
"""

CREATE_TEACHER_GROUP_SUBJECT_LS_TABLE = """
create table if not exists teacher_group_subject_ls (
	id SERIAL PRIMARY KEY,
	teacher text not null,
	subject text not null,
	ls text not null,
	group_name text not null
);
"""

CREATE_TEACHER_TIME_TABLE = """
CREATE TABLE IF NOT EXISTS teacher_time (
    id SERIAL PRIMARY KEY,
    teacher VARCHAR(255) NOT null,
    day text not null,
    time text not null,
    numerator BOOLEAN not null,
    denominator BOOLEAN not null
);
"""

KIRILL_SQL = """
CREATE OR REPLACE FUNCTION select_configuration(
    OUT cur_hours REFCURSOR,
    OUT cur_lock_slot REFCURSOR,
    OUT cur_teacher_time REFCURSOR,
    out cur_body_classroom REFCURSOR,
    out cur_classrooms REFCURSOR,
    out cur_groups  REFCURSOR,
    out cur_property REFCURSOR,
    out cur_subjects REFCURSOR,
    out cur_tgsl REFCURSOR,
    out cur_teachers REFCURSOR,
    out cur_times REFCURSOR,
    out cur_schedule_data REFCURSOR,
    out cur_linking REFCURSOR
) AS $$
BEGIN
    cur_hours := 'cursor_hours';
    cur_lock_slot := 'cursor_lock_slot';
    cur_teacher_time := 'cursor_teacher_time';
  cur_body_classroom := 'cursor_body_classroom';
    cur_classrooms := 'cursor_classrooms';
    cur_groups := 'cursor_groups';
    cur_property := 'cursor_property';
    cur_subjects := 'cursor_subjects';
    cur_tgsl := 'cursor_tgsl';
    cur_teachers := 'cursor_teachers';
    cur_times := 'cursor_times';
    cur_schedule_data := 'cursor_schedule_data';
    cur_linking := 'cursor_linking';
    

  OPEN cur_hours FOR SELECT * FROM hours;
  OPEN cur_lock_slot FOR SELECT * FROM lock_slot;
  OPEN cur_teacher_time FOR SELECT * FROM teacher_time;

  OPEN cur_body_classroom FOR SELECT * FROM body_classroom;  
  OPEN cur_classrooms FOR SELECT  id FROM classrooms;  
  OPEN cur_groups FOR SELECT  name FROM groups ORDER BY id;
  OPEN cur_property FOR SELECT * FROM property;  
  OPEN cur_subjects FOR SELECT id, name FROM subjects;  
  OPEN cur_tgsl FOR 
	select 
	    tgsl.id,
	    tgsl.teacher ,
	    tgsl.subject,
	    tgsl.ls,
	    tgsl.group_single as group,
	    h.lectures,
	    h.seminars,
	    h.labs
	from (
	SELECT 
	  t.id, 
	  t.teacher,
	  t.subject,
	  t.ls,
	  json_array_elements_text(t.group_name::json) as group_single
	  FROM teacher_group_subject_ls t
	) tgsl
	LEFT JOIN hours h ON tgsl.subject = h.subject_name and tgsl.group_single = h.group_name
	where lectures is not null or seminars is not null or labs is not null
	order by id, subject, tgsl.group_single, ls;
  OPEN cur_teachers FOR SELECT id, name FROM teachers;  
  OPEN cur_times FOR SELECT name FROM times ORDER BY id;  
  OPEN cur_schedule_data FOR SELECT  teacher, subject, ls, group_name FROM teacher_group_subject_ls;
  OPEN cur_linking FOR select subject, type_subj, JSON_AGG(DISTINCT teacher) AS teachers, JSON_AGG(DISTINCT group_name) AS groups from linking  GROUP BY id_para, subject, type_subj order by id_para;

    RETURN;
END;
$$ LANGUAGE plpgsql;
"""

CREATE_SUBJECTS_TABLE = """
CREATE TABLE IF NOT EXISTS subjects (
    id SERIAL PRIMARY KEY,
    name VARCHAR(255) NOT NULL UNIQUE,
    property VARCHAR(255) NOT NULL
);
"""

CREATE_TIMES_TABLE = """
CREATE TABLE IF NOT EXISTS times (
    id SERIAL PRIMARY KEY,
    name VARCHAR(255) NOT NULL UNIQUE
);
"""

CREATE_CLASSROOMS_TABLE = """
CREATE TABLE IF NOT EXISTS classrooms (
    id SERIAL PRIMARY KEY,
    name VARCHAR(255) NOT NULL UNIQUE,
    capacity int4 NOT NULL,
    property VARCHAR(255) NOT NULL,
    body VARCHAR(255) NOT NULL
);
"""

CREATE_GS = """
CREATE TABLE IF NOT EXISTS public.group_to_subject (
    group_id int4 NOT NULL,
    subject_id int4 NOT NULL
);
"""

CREATE_TS = """
CREATE TABLE IF NOT EXISTS public.teacher_to_subject (
    teacher_id int4 NOT NULL,
    subject_id int4 NOT NULL
);
"""

CREATE_TABLE_PROPERTY = """
CREATE TABLE IF NOT EXISTS property (
    id SERIAL PRIMARY KEY,
    name VARCHAR(255) NOT NULL UNIQUE
);
"""
INSERT_PROPERTY = """
insert into property(name)
values
	('dashboard'),
	('computer_linux'),
	('proektor'),
	('computer_windows'),
	('wi-fi'),
	('apples'),
	('banana');
"""
SELECT_PROPERTY = """
select name from property;
"""

DROP_TABLE_PROPERTY = """
drop table property;
"""

INSERT_TEACHER = """
insert into public.teachers(name)
	values 
"""

GROUP_TO_SUBJECT = """
select g.name, s.name, gs.hours
from groups g
join group_to_subject gs on gs.group_id = g.id
join subjects s on gs.subject_id = s.id;
"""

TEACHER_TO_SUBJECT = """
select t.name, s.name
from teachers t
join teacher_to_subject ts on ts.teacher_id = t.id
join subjects s on ts.subject_id = s.id;
"""

SELECT_GROUPS = """
select name, count from groups
order by name;
"""

SELECT_HOURS = """
select subject_name, group_name, seminars, lectures, labs from hours
where subject_name = %s and group_name = %s;
"""

SELECT_ALL_HOURS = """
select subject_name, group_name, seminars, lectures, labs from hours;
"""

SELECT_CLASSROOMS = """
select name, capacity, property, body from classrooms;
"""

SELECT_TEACHER_GROUP_SUBJECT_LS = """
select * from teacher_group_subject_ls tgsl
where teacher =
"""

SELECT_TEACHER_TIME = """
select teacher, day, time, numerator, denominator from teacher_time
where teacher =
"""

SELECT_LOCK = """
select group_name, day, time, numerator, denominator from lock_slot
where group_name =
"""

TEST_TABLE = """
create table if not exists test_table (
	id serial primary key,
	subject_name text not null,
	group_name text not null,
	numerator BOOLEAN not null,
	denominator BOOLEAN not null,
	seminars int4 not null,
	lectures int4 not null,
	labs int4 not null
)
"""


SELECT_LOCKS = """
select group_name, day, time, numerator, denominator, body from lock_slot;
"""

SELECT_SUBJECTS_DICT = """
select name, property from subjects;
"""

SELECT_SUBJECTS = """
select name, property from subjects
order by name;
"""

SELECT_SUBJECT_ID = """
select name from {table}
where id=%s;
"""

SELECT_TEACHERS = """
select name from teachers
order by name;
"""

SELECT_TIMES = """
select name from times;
"""

INSERT_TEACHERS = """
insert into teachers (name)
values
  ('Погорелко Е.А.'),
  ('Кожухов К.А.'),
  ('Зязина Н.А.'),
  ('Киселев П.Б.'),
  ('Галактионов А.А.'),
  ('Дубинин А.А.'),
  ('Дербин Е.А.'),
  ('Янгель К.Д.'),
  ('Владычинская В.А.'),
  ('Антонова В.А.');
"""

INSERT_GROUPS = """
INSERT INTO groups (name, count)
VALUES
  ('ИУ10-11', 15),
  ('ИУ10-12', 20),
  ('ИУ10-13', 12),
  ('ИУ10-14', 18),
  ('ИУ10-15', 22),
  ('ИУ10-16', 14),
  ('ИУ10-17', 19),
  ('ИУ10-18', 16),
  ('ИУ10-19', 21),
  ('ИУ10-31', 13),
  ('ИУ10-32', 17),
  ('ИУ10-33', 24),
  ('ИУ10-34', 15),
  ('ИУ10-35', 20),
  ('ИУ10-36', 12),
  ('ИУ10-37', 18),
  ('ИУ10-38', 22),
  ('ИУ10-39', 14),
  ('ИУ10-51', 19),
  ('ИУ10-52', 16),
  ('ИУ10-53', 21),
  ('ИУ10-54', 13),
  ('ИУ10-55', 17),
  ('ИУ10-56', 24),
  ('ИУ10-57', 15),
  ('ИУ10-58', 20),
  ('ИУ10-59', 12),
  ('ИУ10-71', 18),
  ('ИУ10-72', 22),
  ('ИУ10-73', 14),
  ('ИУ10-74', 19),
  ('ИУ10-75', 16),
  ('ИУ10-76', 21),
  ('ИУ10-77', 13),
  ('ИУ10-78', 17),
  ('ИУ10-79', 24),
  ('ИУ10-91', 15),
  ('ИУ10-92', 20),
  ('ИУ10-93', 12),
  ('ИУ10-94', 18),
  ('ИУ10-95', 22),
  ('ИУ10-96', 14),
  ('ИУ10-97', 19),
  ('ИУ10-98', 16),
  ('ИУ10-99', 21),
  ('ИУ10-111', 13),
  ('ИУ10-112', 17),
  ('ИУ10-113', 24),
  ('ИУ10-114', 15),
  ('ИУ10-115', 20),
  ('ИУ10-116', 12),
  ('ИУ10-117', 18),
  ('ИУ10-118', 22),
  ('ИУ10-119', 14);
"""

INSERT_SUBJECTS = """
insert into subjects (name, property)
values
  ('Языки программирования', '["computer_linux", "apples"]'),
  ('Виртуализация', '["computer_windows", "banana"]'),
  ('Java', '["computer_windows", "banana"]'),
  ('Linux', '["wi-fi"]'),
  ('Сети', '["dashboard", "banana"]'),
  ('ТОТР', '["computer_windows", "apples", "wi-fi"]'),
  ('Базы Данных', '["computer_windows", "banana"]'),
  ('Инфопси', '["computer_windows", "dashboard", "banana", "wi-fi"]'),
  ('Спец дисциплина', '["proektor", "banana"]'),
  ('Информатика', '["computer_linux", "proektor", "wi-fi"]'),
  ('Введение в специальность', '["dashboard", "proektor", "wi-fi"]'),
  ('Дискретная математика', '["computer_windows", "dashboard", "banana", "wi-fi"]'),
  ('Основы российской государственности', '[]'),
  ('Системное программное обеспечение', '["computer_windows", "computer_linux"]'),
  ('Языки программирования низкого уровня', '["computer_linux"]'),
  ('Защищенные базы данных', '["computer_windows", "banana", "wi-fi"]'),
  ('Основы информационной безопасности', '[]'),
  ('Политологические основы информационной безопасности', '[]'),
  ('Электроника и схемотехника', '["dashboard"]'),
  ('Дисциплина кафедры 10', '[]'),
  ('Математические основы криптографии', '["dashboard", "proektor"]'),
  ('Основы обратной разработки', '["computer_windows", "banana"]'),
  ('Операционные системы', '["computer_windows", "banana"]'),
  ('Теория информации и кодирования', '["computer_windows", "banana"]'),
  ('Информационно-телекоммуникационные системы', '["proektor", "banana"]'),
  ('Архитектура современной вычислительной техники', '["computer_windows", "banana"]'),
  ('Компиляторные технологии в задачах анализа программного кода', '["proektor", "banana"]'),
  ('Методы и средства криптографической защиты информации', '["computer_windows", "banana", "wi-fi"]'),
  ('Безопасность жизнедеятельности', '["computer_windows", "banana"]'),
  ('Теоретические основы технических разведок: Физические принципы', '["computer_windows", "banana"]'),
  ('Антивирусное программное обеспечение', '["computer_windows", "banana"]'),
  ('Проектирование, разработка и тестирование программного обеспечения', '["proektor", "banana"]'),
  ('Стеганографические методы защиты информации', '["computer_windows", "banana"]'),
  ('Анализ вредоносного программного обеспечения', '["apples", "banana"]'),
  ('Защита информации от утечки по техническим каналам', '["computer_windows", "banana"]'),
  ('Информационный поиск и анализ данных', '["apples", "banana"]'),
  ('Разработка безопасных операционных систем', '["computer_windows", "apples"]'),
  ('Системы обнаружения вторжений', '["computer_windows", "banana"]'),
  ('Дисциплина кафедры 3', '["computer_windows", "banana"]'),
  ('Нормативные и правовые основы защиты информации', '["apples", "banana"]'),
  ('Системы и технологии искусственного интеллекта', '["computer_windows", "banana", "wi-fi"]'),
  ('Моделирование трафика в защищенных сетях', '["computer_windows", "banana", "wi-fi"]'),
  ('Основы информационно-психологической безопасности', '["computer_windows", "banana"]'),
  ('Основы информационного противоборства', '["dashboard", "banana", "wi-fi"]'),
  ('Сервисы информационной безопасности на основе инфраструктуры открытых ключей', '["apples", "banana"]'),
  ('Компьютерно-техническая экспертиза', '["computer_windows", "banana"]'),
  ('Сертификация средств защиты информации', '["proektor", "banana"]'),
  ('Защита информации от несанкционированного доступа', '["apples", "banana"]'),
  ('Менеджмент систем информационной безопасности', '["dashboard", "banana"]'),
  ('Дисциплина кафедры 4', '["dashboard", "banana"]'),
  ('Дисциплина кафедры 9', '["computer_windows", "banana"]'),
  ('Компьютерные инциденты в информационно-телекоммуникационных системах', '["computer_windows", "banana"]'),
  ('Логико-семантический анализ информации', '["computer_windows", "banana"]'),
  ('Теория противодействия компьютерным атакам', '["computer_windows", "banana", "wi-fi"]'),
  ('Анализ рисков информационной безопасности', '["computer_windows", "banana"]');
"""

INSERT_HOURS = """
insert into hours(subject_name, group_name, seminars, lectures, labs)
values 
	('Информатика', 'ИУ10-11', 0, 2, 1),
	('Информатика', 'ИУ10-12', 0, 2, 1),
	('Информатика', 'ИУ10-13', 0, 2, 1),
	('Информатика', 'ИУ10-14', 0, 2, 1),
	('Информатика', 'ИУ10-15', 0, 2, 1),
	('Информатика', 'ИУ10-16', 0, 2, 1),
	('Информатика', 'ИУ10-17', 0, 2, 1),
	('Информатика', 'ИУ10-18', 0, 2, 1),
	('Информатика', 'ИУ10-19', 0, 2, 1),
	('Введение в специальность', 'ИУ10-11', 0, 2, 0),
	('Введение в специальность', 'ИУ10-12', 0, 2, 0),
	('Введение в специальность', 'ИУ10-13', 0, 2, 0),
	('Введение в специальность', 'ИУ10-14', 0, 2, 0),
	('Введение в специальность', 'ИУ10-15', 0, 2, 0),
	('Введение в специальность', 'ИУ10-16', 0, 2, 0),
	('Введение в специальность', 'ИУ10-17', 0, 2, 0),
	('Введение в специальность', 'ИУ10-18', 0, 2, 0),
	('Введение в специальность', 'ИУ10-19', 0, 2, 0),
	('Дискретная математика', 'ИУ10-11', 2, 2, 0),
	('Дискретная математика', 'ИУ10-12', 2, 2, 0),
	('Дискретная математика', 'ИУ10-13', 2, 2, 0),
	('Дискретная математика', 'ИУ10-14', 2, 2, 0),
	('Дискретная математика', 'ИУ10-15', 2, 2, 0),
	('Дискретная математика', 'ИУ10-16', 2, 2, 0),
	('Дискретная математика', 'ИУ10-17', 2, 2, 0),
	('Дискретная математика', 'ИУ10-18', 2, 2, 0),
	('Дискретная математика', 'ИУ10-19', 2, 2, 0),
    ('Основы российской государственности', 'ИУ10-11', 0, 1, 0),
	('Основы российской государственности', 'ИУ10-12', 0, 1, 0),
	('Основы российской государственности', 'ИУ10-13', 0, 1, 0),
	('Основы российской государственности', 'ИУ10-14', 0, 1, 0),
	('Основы российской государственности', 'ИУ10-15', 0, 1, 0),
	('Основы российской государственности', 'ИУ10-16', 0, 1, 0),
	('Основы российской государственности', 'ИУ10-17', 0, 1, 0),
	('Основы российской государственности', 'ИУ10-18', 0, 1, 0),
	('Основы российской государственности', 'ИУ10-19', 0, 1, 0),
	('Языки программирования', 'ИУ10-11', 0, 0, 2),
	('Языки программирования', 'ИУ10-12', 0, 0, 2),
	('Языки программирования', 'ИУ10-13', 0, 0, 2),
	('Языки программирования', 'ИУ10-14', 0, 0, 2),
	('Языки программирования', 'ИУ10-15', 0, 0, 2),
	('Языки программирования', 'ИУ10-16', 0, 0, 2),
	('Языки программирования', 'ИУ10-17', 0, 0, 2),
	('Языки программирования', 'ИУ10-18', 0, 0, 2),
	('Языки программирования', 'ИУ10-19', 0, 0, 2),
	('Системное программное обеспечение', 'ИУ10-31', 0, 2, 2),
	('Системное программное обеспечение', 'ИУ10-32', 0, 2, 2),
	('Системное программное обеспечение', 'ИУ10-33', 0, 2, 2),
	('Системное программное обеспечение', 'ИУ10-34', 0, 2, 2),
	('Системное программное обеспечение', 'ИУ10-35', 0, 2, 2),
	('Языки программирования', 'ИУ10-31', 0, 0, 2),
	('Языки программирования', 'ИУ10-32', 0, 0, 2),
	('Языки программирования', 'ИУ10-33', 0, 0, 2),
	('Языки программирования', 'ИУ10-34', 0, 0, 2),
	('Языки программирования', 'ИУ10-35', 0, 0, 2),
	('Языки программирования', 'ИУ10-36', 0, 0, 2),
	('Языки программирования', 'ИУ10-37', 0, 0, 2),
	('Языки программирования', 'ИУ10-38', 0, 0, 2),
	('Языки программирования', 'ИУ10-39', 0, 0, 2),
	('Электроника и схемотехника', 'ИУ10-51', 1, 2, 1),
	('Электроника и схемотехника', 'ИУ10-52', 1, 2, 1),
	('Электроника и схемотехника', 'ИУ10-53', 1, 2, 1),
	('Электроника и схемотехника', 'ИУ10-54', 1, 2, 1),
	('Электроника и схемотехника', 'ИУ10-55', 1, 2, 1),
	('Электроника и схемотехника', 'ИУ10-56', 1, 2, 1),
	('Электроника и схемотехника', 'ИУ10-57', 1, 2, 1),
	('Электроника и схемотехника', 'ИУ10-58', 1, 2, 1),
	('Электроника и схемотехника', 'ИУ10-59', 1, 2, 1),
	('Дисциплина кафедры 10', 'ИУ10-51', 0, 2, 0),
	('Дисциплина кафедры 10', 'ИУ10-52', 0, 2, 0),
	('Дисциплина кафедры 10', 'ИУ10-53', 0, 2, 0),
	('Дисциплина кафедры 10', 'ИУ10-54', 0, 2, 0),
	('Дисциплина кафедры 10', 'ИУ10-55', 0, 2, 0),
	('Дисциплина кафедры 10', 'ИУ10-56', 0, 2, 0),
	('Дисциплина кафедры 10', 'ИУ10-57', 0, 2, 0),
	('Дисциплина кафедры 10', 'ИУ10-58', 0, 2, 0),
	('Дисциплина кафедры 10', 'ИУ10-59', 0, 2, 0),
	('Математические основы криптографии', 'ИУ10-51', 1, 2, 0),
	('Математические основы криптографии', 'ИУ10-52', 1, 2, 0),
	('Математические основы криптографии', 'ИУ10-53', 1, 2, 0),
	('Математические основы криптографии', 'ИУ10-54', 1, 2, 0),
	('Математические основы криптографии', 'ИУ10-55', 1, 2, 0),
	('Математические основы криптографии', 'ИУ10-56', 1, 2, 0),
	('Математические основы криптографии', 'ИУ10-57', 1, 2, 0),
	('Математические основы криптографии', 'ИУ10-58', 1, 2, 0),
	('Математические основы криптографии', 'ИУ10-59', 1, 2, 0),
	('Операционные системы', 'ИУ10-51', 0, 2, 1),
	('Операционные системы', 'ИУ10-52', 0, 2, 1),
	('Операционные системы', 'ИУ10-53', 0, 2, 1),
	('Операционные системы', 'ИУ10-54', 0, 2, 1),
	('Операционные системы', 'ИУ10-55', 0, 2, 1),
	('Операционные системы', 'ИУ10-56', 0, 2, 1),
	('Операционные системы', 'ИУ10-57', 0, 2, 1),
	('Операционные системы', 'ИУ10-58', 0, 2, 1),
	('Операционные системы', 'ИУ10-59', 0, 2, 1),
	('Основы обратной разработки', 'ИУ10-51', 0, 0, 1),
	('Основы обратной разработки', 'ИУ10-52', 0, 0, 1),
	('Основы обратной разработки', 'ИУ10-53', 0, 0, 1),
	('Основы обратной разработки', 'ИУ10-54', 0, 0, 1),
	('Основы обратной разработки', 'ИУ10-55', 0, 0, 1),
	('Основы обратной разработки', 'ИУ10-56', 0, 0, 1),
	('Основы обратной разработки', 'ИУ10-57', 0, 0, 1),
	('Основы обратной разработки', 'ИУ10-58', 0, 0, 1),
	('Основы обратной разработки', 'ИУ10-59', 0, 0, 1),
	('Теория информации и кодирования', 'ИУ10-51', 1, 2, 0),
	('Теория информации и кодирования', 'ИУ10-52', 1, 2, 0),
	('Теория информации и кодирования', 'ИУ10-53', 1, 2, 0),
	('Теория информации и кодирования', 'ИУ10-54', 1, 2, 0),
	('Теория информации и кодирования', 'ИУ10-55', 1, 2, 0),
	('Теория информации и кодирования', 'ИУ10-56', 1, 2, 0),
	('Теория информации и кодирования', 'ИУ10-57', 1, 2, 0),
	('Теория информации и кодирования', 'ИУ10-58', 1, 2, 0),
	('Теория информации и кодирования', 'ИУ10-59', 1, 2, 0),
	('Информационно-телекоммуникационные системы', 'ИУ10-51', 0, 2, 1),
	('Информационно-телекоммуникационные системы', 'ИУ10-52', 0, 2, 1),
	('Информационно-телекоммуникационные системы', 'ИУ10-53', 0, 2, 1),
	('Информационно-телекоммуникационные системы', 'ИУ10-54', 0, 2, 1),
	('Информационно-телекоммуникационные системы', 'ИУ10-55', 0, 2, 1),
	('Информационно-телекоммуникационные системы', 'ИУ10-56', 0, 2, 1),
	('Информационно-телекоммуникационные системы', 'ИУ10-57', 0, 2, 1),
	('Информационно-телекоммуникационные системы', 'ИУ10-58', 0, 2, 1),
	('Информационно-телекоммуникационные системы', 'ИУ10-59', 0, 2, 1),
	('Методы и средства криптографической защиты информации', 'ИУ10-71', 1, 2, 0),
	('Методы и средства криптографической защиты информации', 'ИУ10-72', 1, 2, 0),
	('Методы и средства криптографической защиты информации', 'ИУ10-73', 1, 2, 0),
	('Методы и средства криптографической защиты информации', 'ИУ10-74', 1, 2, 0),
	('Методы и средства криптографической защиты информации', 'ИУ10-75', 1, 2, 0),
	('Методы и средства криптографической защиты информации', 'ИУ10-76', 1, 2, 0),
	('Методы и средства криптографической защиты информации', 'ИУ10-77', 1, 2, 0),
	('Методы и средства криптографической защиты информации', 'ИУ10-78', 1, 2, 0),
	('Методы и средства криптографической защиты информации', 'ИУ10-79', 1, 2, 0),
	('Антивирусное программное обеспечение', 'ИУ10-71', 0, 2, 1),
	('Антивирусное программное обеспечение', 'ИУ10-72', 0, 2, 1),
	('Антивирусное программное обеспечение', 'ИУ10-73', 0, 2, 1),
	('Антивирусное программное обеспечение', 'ИУ10-74', 0, 2, 1),
	('Антивирусное программное обеспечение', 'ИУ10-75', 0, 2, 1),
	('Антивирусное программное обеспечение', 'ИУ10-76', 0, 2, 1),
	('Антивирусное программное обеспечение', 'ИУ10-77', 0, 2, 1),
	('Антивирусное программное обеспечение', 'ИУ10-78', 0, 2, 1),
	('Антивирусное программное обеспечение', 'ИУ10-79', 0, 2, 1),
	('Проектирование, разработка и тестирование программного обеспечения', 'ИУ10-71', 0, 2, 1),
	('Проектирование, разработка и тестирование программного обеспечения', 'ИУ10-72', 0, 2, 1),
	('Проектирование, разработка и тестирование программного обеспечения', 'ИУ10-73', 0, 2, 1),
	('Проектирование, разработка и тестирование программного обеспечения', 'ИУ10-74', 0, 2, 1),
	('Проектирование, разработка и тестирование программного обеспечения', 'ИУ10-75', 0, 2, 1),
	('Проектирование, разработка и тестирование программного обеспечения', 'ИУ10-76', 0, 2, 1),
	('Проектирование, разработка и тестирование программного обеспечения', 'ИУ10-77', 0, 2, 1),
	('Проектирование, разработка и тестирование программного обеспечения', 'ИУ10-78', 0, 2, 1),
	('Проектирование, разработка и тестирование программного обеспечения', 'ИУ10-79', 0, 2, 1),
	('Стеганографические методы защиты информации', 'ИУ10-71', 0, 2, 1),
	('Стеганографические методы защиты информации', 'ИУ10-72', 0, 2, 1),
	('Стеганографические методы защиты информации', 'ИУ10-73', 0, 2, 1),
	('Стеганографические методы защиты информации', 'ИУ10-74', 0, 2, 1),
	('Стеганографические методы защиты информации', 'ИУ10-75', 0, 2, 1),
	('Стеганографические методы защиты информации', 'ИУ10-76', 0, 2, 1),
	('Стеганографические методы защиты информации', 'ИУ10-77', 0, 2, 1),
	('Стеганографические методы защиты информации', 'ИУ10-78', 0, 2, 1),
	('Стеганографические методы защиты информации', 'ИУ10-79', 0, 2, 1),
	('Анализ вредоносного программного обеспечения', 'ИУ10-71', 0, 0, 2),
	('Анализ вредоносного программного обеспечения', 'ИУ10-72', 0, 0, 2),
	('Анализ вредоносного программного обеспечения', 'ИУ10-73', 0, 0, 2),
	('Анализ вредоносного программного обеспечения', 'ИУ10-74', 0, 0, 2),
	('Анализ вредоносного программного обеспечения', 'ИУ10-75', 0, 0, 2),
	('Анализ вредоносного программного обеспечения', 'ИУ10-76', 0, 0, 2),
	('Анализ вредоносного программного обеспечения', 'ИУ10-77', 0, 0, 2),
	('Анализ вредоносного программного обеспечения', 'ИУ10-78', 0, 0, 2),
	('Анализ вредоносного программного обеспечения', 'ИУ10-79', 0, 0, 2),
	('Защита информации от утечки по техническим каналам', 'ИУ10-71', 0, 2, 1),
	('Защита информации от утечки по техническим каналам', 'ИУ10-72', 0, 2, 1),
	('Защита информации от утечки по техническим каналам', 'ИУ10-73', 0, 2, 1),
	('Защита информации от утечки по техническим каналам', 'ИУ10-74', 0, 2, 1),
	('Защита информации от утечки по техническим каналам', 'ИУ10-75', 0, 2, 1),
	('Защита информации от утечки по техническим каналам', 'ИУ10-76', 0, 2, 1),
	('Защита информации от утечки по техническим каналам', 'ИУ10-77', 0, 2, 1),
	('Защита информации от утечки по техническим каналам', 'ИУ10-78', 0, 2, 1),
	('Защита информации от утечки по техническим каналам', 'ИУ10-79', 0, 2, 1),
	('Информационный поиск и анализ данных', 'ИУ10-91', 0, 1, 1),
	('Информационный поиск и анализ данных', 'ИУ10-92', 0, 1, 1),
	('Информационный поиск и анализ данных', 'ИУ10-93', 0, 1, 1),
	('Информационный поиск и анализ данных', 'ИУ10-94', 0, 1, 1),
	('Информационный поиск и анализ данных', 'ИУ10-95', 0, 1, 1),
	('Информационный поиск и анализ данных', 'ИУ10-96', 0, 1, 1),
	('Информационный поиск и анализ данных', 'ИУ10-97', 0, 1, 1),
	('Информационный поиск и анализ данных', 'ИУ10-98', 0, 1, 1),
	('Информационный поиск и анализ данных', 'ИУ10-99', 0, 1, 1),
	('Системы обнаружения вторжений', 'ИУ10-91', 0, 2, 1),
	('Системы обнаружения вторжений', 'ИУ10-92', 0, 2, 1),
	('Системы обнаружения вторжений', 'ИУ10-93', 0, 2, 1),
	('Системы обнаружения вторжений', 'ИУ10-94', 0, 2, 1),
	('Системы обнаружения вторжений', 'ИУ10-95', 0, 2, 1),
	('Системы обнаружения вторжений', 'ИУ10-96', 0, 2, 1),
	('Системы обнаружения вторжений', 'ИУ10-97', 0, 2, 1),
	('Системы обнаружения вторжений', 'ИУ10-98', 0, 2, 1),
	('Системы обнаружения вторжений', 'ИУ10-99', 0, 2, 1),
	('Дисциплина кафедры 3', 'ИУ10-91', 1, 2, 0),
	('Дисциплина кафедры 3', 'ИУ10-92', 1, 2, 0),
	('Дисциплина кафедры 3', 'ИУ10-93', 1, 2, 0),
	('Дисциплина кафедры 3', 'ИУ10-94', 1, 2, 0),
	('Дисциплина кафедры 3', 'ИУ10-95', 1, 2, 0),
	('Дисциплина кафедры 3', 'ИУ10-96', 1, 2, 0),
	('Дисциплина кафедры 3', 'ИУ10-97', 1, 2, 0),
	('Дисциплина кафедры 3', 'ИУ10-98', 1, 2, 0),
	('Дисциплина кафедры 3', 'ИУ10-99', 1, 2, 0),
	('Нормативные и правовые основы защиты информации', 'ИУ10-91', 0, 2, 0),
	('Нормативные и правовые основы защиты информации', 'ИУ10-92', 0, 2, 0),
	('Нормативные и правовые основы защиты информации', 'ИУ10-93', 0, 2, 0),
	('Нормативные и правовые основы защиты информации', 'ИУ10-94', 0, 2, 0),
	('Нормативные и правовые основы защиты информации', 'ИУ10-95', 0, 2, 0),
	('Нормативные и правовые основы защиты информации', 'ИУ10-96', 0, 2, 0),
	('Нормативные и правовые основы защиты информации', 'ИУ10-97', 0, 2, 0),
	('Нормативные и правовые основы защиты информации', 'ИУ10-98', 0, 2, 0),
	('Нормативные и правовые основы защиты информации', 'ИУ10-99', 0, 2, 0),
	('Системы и технологии искусственного интеллекта', 'ИУ10-91', 0, 2, 1),
	('Системы и технологии искусственного интеллекта', 'ИУ10-92', 0, 2, 1),
	('Системы и технологии искусственного интеллекта', 'ИУ10-93', 0, 2, 1),
	('Системы и технологии искусственного интеллекта', 'ИУ10-94', 0, 2, 1),
	('Системы и технологии искусственного интеллекта', 'ИУ10-95', 0, 2, 1),
	('Системы и технологии искусственного интеллекта', 'ИУ10-96', 0, 2, 1),
	('Системы и технологии искусственного интеллекта', 'ИУ10-97', 0, 2, 1),
	('Системы и технологии искусственного интеллекта', 'ИУ10-98', 0, 2, 1),
	('Системы и технологии искусственного интеллекта', 'ИУ10-99', 0, 2, 1),
	('Моделирование трафика в защищенных сетях', 'ИУ10-91', 1, 0, 1),
	('Моделирование трафика в защищенных сетях', 'ИУ10-92', 1, 0, 1),
	('Моделирование трафика в защищенных сетях', 'ИУ10-93', 1, 0, 1),
	('Моделирование трафика в защищенных сетях', 'ИУ10-94', 1, 0, 1),
	('Моделирование трафика в защищенных сетях', 'ИУ10-95', 1, 0, 1),
	('Моделирование трафика в защищенных сетях', 'ИУ10-96', 1, 0, 1),
	('Моделирование трафика в защищенных сетях', 'ИУ10-97', 1, 0, 1),
	('Моделирование трафика в защищенных сетях', 'ИУ10-98', 1, 0, 1),
	('Моделирование трафика в защищенных сетях', 'ИУ10-99', 1, 0, 1),
	('Основы информационно-психологической безопасности', 'ИУ10-111', 1, 2, 0),
	('Основы информационно-психологической безопасности', 'ИУ10-112', 1, 2, 0),
	('Основы информационно-психологической безопасности', 'ИУ10-113', 1, 2, 0),
	('Основы информационно-психологической безопасности', 'ИУ10-114', 1, 2, 0),
	('Основы информационно-психологической безопасности', 'ИУ10-115', 1, 2, 0),
	('Основы информационно-психологической безопасности', 'ИУ10-116', 1, 2, 0),
	('Основы информационно-психологической безопасности', 'ИУ10-117', 1, 2, 0),
	('Основы информационно-психологической безопасности', 'ИУ10-118', 1, 2, 0),
	('Основы информационно-психологической безопасности', 'ИУ10-119', 1, 2, 0),
	('Компьютерно-техническая экспертиза', 'ИУ10-111', 0, 3, 1),
	('Компьютерно-техническая экспертиза', 'ИУ10-112', 0, 3, 1),
	('Компьютерно-техническая экспертиза', 'ИУ10-113', 0, 3, 1),
	('Компьютерно-техническая экспертиза', 'ИУ10-114', 0, 3, 1),
	('Компьютерно-техническая экспертиза', 'ИУ10-115', 0, 3, 1),
	('Компьютерно-техническая экспертиза', 'ИУ10-116', 0, 3, 1),
	('Компьютерно-техническая экспертиза', 'ИУ10-117', 0, 3, 1),
	('Компьютерно-техническая экспертиза', 'ИУ10-118', 0, 3, 1),
	('Компьютерно-техническая экспертиза', 'ИУ10-119', 0, 3, 1),
	('Сертификация средств защиты информации', 'ИУ10-111', 0, 2, 1),
	('Сертификация средств защиты информации', 'ИУ10-112', 0, 2, 1),
	('Сертификация средств защиты информации', 'ИУ10-113', 0, 2, 1),
	('Сертификация средств защиты информации', 'ИУ10-114', 0, 2, 1),
	('Сертификация средств защиты информации', 'ИУ10-115', 0, 2, 1),
	('Сертификация средств защиты информации', 'ИУ10-116', 0, 2, 1),
	('Сертификация средств защиты информации', 'ИУ10-117', 0, 2, 1),
	('Сертификация средств защиты информации', 'ИУ10-118', 0, 2, 1),
	('Сертификация средств защиты информации', 'ИУ10-119', 0, 2, 1),
	('Защита информации от несанкционированного доступа', 'ИУ10-91', 0, 2, 1),
	('Защита информации от несанкционированного доступа', 'ИУ10-92', 0, 2, 1),
	('Защита информации от несанкционированного доступа', 'ИУ10-93', 0, 2, 1),
	('Защита информации от несанкционированного доступа', 'ИУ10-94', 0, 2, 1),
	('Защита информации от несанкционированного доступа', 'ИУ10-95', 0, 2, 1),
	('Защита информации от несанкционированного доступа', 'ИУ10-96', 0, 2, 1),
	('Защита информации от несанкционированного доступа', 'ИУ10-97', 0, 2, 1),
	('Защита информации от несанкционированного доступа', 'ИУ10-98', 0, 2, 1),
	('Защита информации от несанкционированного доступа', 'ИУ10-99', 0, 2, 1),
	('Дисциплина кафедры 4', 'ИУ10-111', 1, 1, 0),
	('Дисциплина кафедры 4', 'ИУ10-112', 1, 1, 0),
	('Дисциплина кафедры 4', 'ИУ10-113', 1, 1, 0),
	('Дисциплина кафедры 4', 'ИУ10-114', 1, 1, 0),
	('Дисциплина кафедры 4', 'ИУ10-115', 1, 1, 0),
	('Дисциплина кафедры 4', 'ИУ10-116', 1, 1, 0),
	('Дисциплина кафедры 4', 'ИУ10-117', 1, 1, 0),
	('Дисциплина кафедры 4', 'ИУ10-118', 1, 1, 0),
	('Дисциплина кафедры 4', 'ИУ10-119', 1, 1, 0),
	('Дисциплина кафедры 9', 'ИУ10-111', 0, 2, 1),
	('Дисциплина кафедры 9', 'ИУ10-112', 0, 2, 1),
	('Дисциплина кафедры 9', 'ИУ10-113', 0, 2, 1),
	('Дисциплина кафедры 9', 'ИУ10-114', 0, 2, 1),
	('Дисциплина кафедры 9', 'ИУ10-115', 0, 2, 1),
	('Дисциплина кафедры 9', 'ИУ10-116', 0, 2, 1),
	('Дисциплина кафедры 9', 'ИУ10-117', 0, 2, 1),
	('Дисциплина кафедры 9', 'ИУ10-118', 0, 2, 1),
	('Дисциплина кафедры 9', 'ИУ10-119', 0, 2, 1),
	('Компьютерные инциденты в информационно-телекоммуникационных системах', 'ИУ10-111', 0, 3, 1),
	('Компьютерные инциденты в информационно-телекоммуникационных системах', 'ИУ10-112', 0, 3, 1),
	('Компьютерные инциденты в информационно-телекоммуникационных системах', 'ИУ10-113', 0, 3, 1),
	('Компьютерные инциденты в информационно-телекоммуникационных системах', 'ИУ10-114', 0, 3, 1),
	('Компьютерные инциденты в информационно-телекоммуникационных системах', 'ИУ10-115', 0, 3, 1),
	('Компьютерные инциденты в информационно-телекоммуникационных системах', 'ИУ10-116', 0, 3, 1),
	('Компьютерные инциденты в информационно-телекоммуникационных системах', 'ИУ10-117', 0, 3, 1),
	('Компьютерные инциденты в информационно-телекоммуникационных системах', 'ИУ10-118', 0, 3, 1),
	('Компьютерные инциденты в информационно-телекоммуникационных системах', 'ИУ10-119', 0, 3, 1),
	('Логико-семантический анализ информации', 'ИУ10-111', 0, 3, 1),
	('Логико-семантический анализ информации', 'ИУ10-112', 0, 3, 1),
	('Логико-семантический анализ информации', 'ИУ10-113', 0, 3, 1),
	('Логико-семантический анализ информации', 'ИУ10-114', 0, 3, 1),
	('Логико-семантический анализ информации', 'ИУ10-115', 0, 3, 1),
	('Логико-семантический анализ информации', 'ИУ10-116', 0, 3, 1),
	('Логико-семантический анализ информации', 'ИУ10-117', 0, 3, 1),
	('Логико-семантический анализ информации', 'ИУ10-118', 0, 3, 1),
	('Логико-семантический анализ информации', 'ИУ10-119', 0, 3, 1),
	('Теория противодействия компьютерным атакам', 'ИУ10-111', 0, 2, 1),
	('Теория противодействия компьютерным атакам', 'ИУ10-112', 0, 2, 1),
	('Теория противодействия компьютерным атакам', 'ИУ10-113', 0, 2, 1),
	('Теория противодействия компьютерным атакам', 'ИУ10-114', 0, 2, 1),
	('Теория противодействия компьютерным атакам', 'ИУ10-115', 0, 2, 1),
	('Теория противодействия компьютерным атакам', 'ИУ10-116', 0, 2, 1),
	('Теория противодействия компьютерным атакам', 'ИУ10-117', 0, 2, 1),
	('Теория противодействия компьютерным атакам', 'ИУ10-118', 0, 2, 1),
	('Теория противодействия компьютерным атакам', 'ИУ10-119', 0, 2, 1),
	('Анализ рисков информационной безопасности', 'ИУ10-111', 0, 2, 1),
	('Анализ рисков информационной безопасности', 'ИУ10-112', 0, 2, 1),
	('Анализ рисков информационной безопасности', 'ИУ10-113', 0, 2, 1),
	('Анализ рисков информационной безопасности', 'ИУ10-114', 0, 2, 1),
	('Анализ рисков информационной безопасности', 'ИУ10-115', 0, 2, 1),
	('Анализ рисков информационной безопасности', 'ИУ10-116', 0, 2, 1),
	('Анализ рисков информационной безопасности', 'ИУ10-117', 0, 2, 1),
	('Анализ рисков информационной безопасности', 'ИУ10-118', 0, 2, 1),
	('Анализ рисков информационной безопасности', 'ИУ10-119', 0, 2, 1);
"""

INSERT_TIMES = """
insert into times (name)
values
  ('08:30 - 10:00'),
  ('10:10 - 11:40'),
  ('11:50 - 13:20'),
  ('14:05 - 15:35'),
  ('15:55 - 17:25'),
  ('17:35 - 19:05'),
  ('19:15 - 20:45');
"""

INSERT_CLASSROOM = """
insert into classrooms (name, capacity, property, body)
values
  ('405', 25, '["computer_windows", "dashboard", "banana", "wi-fi"]', 'ГЗ'),
  ('404', 30, '["apples", "dashboard", "computer_linux", "wi-fi"]', 'ГЗ'),
  ('120т', 20, '["banana", "wi-fi"]', 'Т'),
  ('228', 60, '["computer_windows", "proektor", "banana", "apples"]', 'ГЗ'),
  ('520к', 18, '["computer_windows", "wi-fi"]', 'В4к'),
  ('534к', 100, '["computer_windows", "dashboard", "computer_linux", "apples"]', 'В4к'),
  ('601к', 15, '["computer_linux"]', 'В4к'),
  ('501к', 10, '["dashboard", "banana", "proektor"]', 'В4к');
"""

INSERT_GS = """
INSERT INTO public.group_to_subject
(group_id, subject_id)
VALUES
  (1, 1),
  (1, 2),
  (1, 3),
  (1, 4),
  (2, 5),
  (2, 6),
  (2, 7),
  (3, 8),
  (3, 9),
  (4, 3),
  (5, 6),
  (6, 2),
  (7, 5),
  (8, 3),
  (9, 7),
  (9, 1);
"""

INSERT_TS = """
INSERT INTO public.teacher_to_subject
(teacher_id, subject_id)
VALUES
  (1, 4),
  (2, 1),
  (3, 3),
  (4, 7),
  (5, 4),
  (6, 2),
  (7, 8),
  (8, 9),
  (9, 4),
  (10, 6),
  (11, 5),
  (12, 4),
  (13, 3),
  (14, 5);
"""

INSERT_TGSL = """
insert into teacher_group_subject_ls (teacher, subject, ls, group_name) values
"""

DELETE_NAMES_FROM_TEACHER_TIME = """
delete from teacher_time
where teacher =
"""

DELETE_SUBJECT_FROM_LOCK_SLOT = """
delete from lock_slot
where group_name =
"""

DELETE_NAMES_FROM_TEACHER_GROUP_SUBJECT_LS = """
delete from teacher_group_subject_ls
where teacher =
"""

SELECT_TABLE_NAME = """
select * from {table}
where name=%s;
"""

SELECT_NAME_FROM_TABLE_WHERE_ID = """
select name from {table}
where id={id};
"""

DELETE_TGSL_NAME = f"delete from teacher_subject_group_ls where name="

DELETE_TEACHER_TIME_NAME = f"delete from teacher_time where name="

SELECT_ALL_TGSL = """
select * from teacher_group_subject_ls;
"""

SELECT_ALL_SUBJECTS = """
select * from subjects;
"""

SELECT_ALL_CLASSROOMS = """
select * from classrooms;
"""



DELETE_TABLE = """
delete from
"""

DROP_ALL_TABLES = """
DO $$
DECLARE
    table_record RECORD;
    drop_query TEXT;
BEGIN
    FOR table_record IN
        SELECT tablename
        FROM pg_tables
        WHERE schemaname = current_schema()  -- удаляем только из текущей схемы
    LOOP
        drop_query := 'DROP TABLE IF EXISTS ' || table_record.tablename || ' CASCADE;';
        EXECUTE drop_query;
    END LOOP;

    RAISE NOTICE 'Все таблицы в схеме % удалены.', current_schema();
END $$;
"""
